hurrican/wita-acceptance-test/src/citrus/resources/templates/cdm/v1/TAL_Verbundleistung_VBLT_04/AKM-PV.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--Note: This file is generated by CDM transformation tool - do not modify this file manually!-->
<SOAP-ENV:Envelope
        xmlns="http://www.mnet.de/esb/cdm/SupplierPartner/LineOrderNotificationService/v1"
        xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <notifyUpdateOrder>
            <order>
                <geschaeftsfall>PV</geschaeftsfall>
                <aenderungsKennzeichen>Standard</aenderungsKennzeichen>
                <geschaeftsfallart>Anbieterwechsel</geschaeftsfallart>
            </order>
            <message>
                <AKM-PV>
                    <meldungsattribute>
                        <vertragsnummer>${contractId}</vertragsnummer>
                        <kundennummer>${customerId}</kundennummer>
                        <aufnehmenderProvider>
                            <providernameAufnehmend>Flexagon</providernameAufnehmend>
                            <uebernahmeDatumGeplant>${plannedAquisitionDate}</uebernahmeDatumGeplant>
                            <antwortfrist>${replyDeadline}</antwortfrist>
                        </aufnehmenderProvider>
                        <endkunde>
                            <person>
                                <anrede>1</anrede>
                                <vorname>Max</vorname>
                                <nachname>Mustermann</nachname>
                            </person>
                        </endkunde>
                        <TAL>
                            <leitung>
                                <leitungsbezeichnung>
                                    <leitungsschluesselzahl>52B</leitungsschluesselzahl>
                                    <onkzA>89</onkzA>
                                    <onkzB>4401</onkzB>
                                    <ordnungsnummer>1000000000</ordnungsnummer>
                                </leitungsbezeichnung>
                            </leitung>
                        </TAL>
                    </meldungsattribute>
                    <meldungspositionen>
                        <position>
                            <meldungscode>0020</meldungscode>
                            <meldungstext>Es liegt uns ein Auftrag zum Providerwechsel vor. Wir bitten um Antwort. Erhalten wir im Rahmen der Antwortfrist von Ihnen keine andere Weisung, gehen wir davon aus, dass sie Ihren Einzelvertrags mit der Telekom zum angegebenen Termin kündigen.</meldungstext>
                        </position>
                    </meldungspositionen>
                </AKM-PV>
            </message>
            <captured>citrus:currentDate(yyyy-MM-dd'T'HH:mm:ss)</captured>
        </notifyUpdateOrder>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
